InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныДляРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныДляРегистрации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Comment>Характеристика/серия номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТК_ДатыОстатковOS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_ДатыОстатковOS</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПолнойВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИзменениеЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИзменениеЦен</Name>
			<Comment>Изменение цен компании и контрагентов</Comment>
			<BasedOn>
				<xr:Item>Document.ПротоколСогласованияЦен</xr:Item>
				<xr:Item>Document.ИзменениеЦен</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Цены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен закупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен относительно которого производим расчет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.ПротоколСогласованияЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(АСУ) Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Comment>Цена относительно которой прозводится расчет новой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Наценка на базовую цену для вычисления устанавливаемой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйПроцентНаценкиНоменклатура</Name>
							<Comment>Наценка на базовую цену для вычисления устанавливаемой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйПроцентНаценкиРодитель</Name>
							<Comment>Наценка на базовую цену для вычисления устанавливаемой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйПроцентНаценкиТип</Name>
							<Comment>Наценка на базовую цену для вычисления устанавливаемой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйПроцентНаценкиГруппаЦенообразования</Name>
							<Comment>Наценка на базовую цену для вычисления устанавливаемой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ОбменФронтПереопределяемый/Ext/Module.bsl
Процедура ЗарегистрироватьИзмененияВУзлах(Объект, МассивУзлов, Замещение) Экспорт
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);

	Если ТипОбъекта = Тип("СправочникОбъект.Номенклатура") ИЛИ ТипОбъекта = Тип("СправочникСсылка.Номенклатура") Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;

		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
		
			Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Штрихкод.Установить(ВыборкаДетальныеЗаписи.Штрихкод);
				
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Штрихкод         = ВыборкаДетальныеЗаписи.Штрихкод;
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписей);
			
		КонецЦикла;
		
		
		Если ТипОбъекта = Тип("СправочникОбъект.Номенклатура") И  Объект.ДополнительныеСвойства.Свойство("РегистрацияНеИспользуемыйТовар") Тогда
			
			ЗарегистрироватьИзмененияВУзлахЦеныТовара(Объект.Ссылка, МассивУзлов);
			
		КонецЕсли;
		
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.СкладыКомпании") Тогда
	
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.Отделы") Тогда
	
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ХарактеристикиНоменклатуры") Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
		
	ИначеЕсли  ТипОбъекта = Тип("СправочникОбъект.СтавкиНДС") Тогда
		
   		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ЕдиницыИзмерения") Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
		
		Если Объект.ДополнительныеСвойства.ЗарегистрироватьOS Тогда
			
			ОбменФронт.ЗпуститьФоновоеЗаданиеРегистрацииСправочникаЕденицИзмерений(МассивУзлов,Объект.Ссылка);
			
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ТорговыеПлощадки") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка";
		
		Запрос.УстановитьПараметр("ТорговаяПлощадка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.Цены") Тогда
		
		
		Для каждого ТекЗапись Из Объект Цикл
			
			НаборЗаписей = РегистрыСведений.ЦеныДляРегистрации.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ТекЗапись.Период);
			НаборЗаписей.Отбор.ТипЦен.Установить(ТекЗапись.ТипЦен);
			НаборЗаписей.Отбор.Номенклатура.Установить(ТекЗапись.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(ТекЗапись.Характеристика);
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора,ТекЗапись,"ТипЦен,Номенклатура,Характеристика,Период");
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписей);
			
		КонецЦикла;	
		
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры") Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.НоменклатураОтделов") Тогда
	   ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
   ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ТК_УчетнаяПолитикаТорговыхПлощадок") Тогда
	    ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);

		//Для каждого ТекЗапись Из Объект Цикл
		//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ТекЗапись.ТорговаяПлощадка)
		//КонецЦикла;	
		
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ТипыНоменклатуры") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Владелец.ТипНоменклатуры = &ТипНоменклатуры";
		
		Запрос.УстановитьПараметр("ТипНоменклатуры", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ТипыЦен") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ТК_НазначениеСкидок") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ИзменениеЦен") Тогда	 ///ИзменениеЦен отмена проведения, регистрируем все товары на тек. дату
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеЦенТовары.Ссылка.ТипЦен КАК ТипЦен,
		|	ИзменениеЦенТовары.Номенклатура КАК Номенклатура,
		|	ИзменениеЦенТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	Документ.ИзменениеЦен.Товары КАК ИзменениеЦенТовары
		|ГДЕ
		|	ИзменениеЦенТовары.Ссылка = &ДокСсылка";
		
		Запрос.УстановитьПараметр("ДокСсылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ПериодВыгрузки = ТекущаяДата();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ЦеныДляРегистрации.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ПериодВыгрузки);
			НаборЗаписей.Отбор.ТипЦен.Установить(ВыборкаДетальныеЗаписи.ТипЦен);
			НаборЗаписей.Отбор.Номенклатура.Установить(ВыборкаДетальныеЗаписи.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(ВыборкаДетальныеЗаписи.ХарактеристикаНоменклатуры);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Период         = ПериодВыгрузки;
			ЗаписьНабора.ТипЦен         = ВыборкаДетальныеЗаписи.ТипЦен;
			ЗаписьНабора.Номенклатура   = ВыборкаДетальныеЗаписи.Номенклатура;
			ЗаписьНабора.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаНоменклатуры;
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписей);
			
		КонецЦикла;
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.Инвентаризация") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.НоменклатураПоставщиков") и ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		  ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.ЕдиницаИзмерения);
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.СтатьиВозврата")  Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Ссылка);
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияВУзлахЦеныТовара(Номенклатура, МассивУзлов) Экспорт
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ТипЦен КАК ТипЦен,
		|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Хар
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СкладыКомпании.ТипЦенРозничнойТорговли КАК ТипЦен
		|	ИЗ
		|		Справочник.СкладыКомпании КАК СкладыКомпании
		|	ГДЕ
		|		НЕ СкладыКомпании.ТипЦенРозничнойТорговли = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		СкладыКомпанииДоступныеЦены.ТипЦен
		|	ИЗ
		|		Справочник.СкладыКомпании.ДоступныеЦены КАК СкладыКомпанииДоступныеЦены
		|	ГДЕ
		|		НЕ СкладыКомпанииДоступныеЦены.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО (ХарактеристикиНоменклатуры.Владелец = &Номенклатура)";
		
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
			
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ПериодВыгрузки = ТекущаяДата();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ЦеныДляРегистрации.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ПериодВыгрузки);
			НаборЗаписей.Отбор.ТипЦен.Установить(ВыборкаДетальныеЗаписи.ТипЦен);
			НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(ВыборкаДетальныеЗаписи.Хар);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Период         = ПериодВыгрузки;
			ЗаписьНабора.ТипЦен         = ВыборкаДетальныеЗаписи.ТипЦен;
			ЗаписьНабора.Номенклатура   = Номенклатура;
			ЗаписьНабора.Характеристика = ВыборкаДетальныеЗаписи.Хар;
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписей);
			
		КонецЦикла;

	
КонецПроцедуры

Процедура РегистрацияТоваровДокумента(ТипОбъекта = Неопределено,ДатаРегистрации,СкладКомпании,ТоварыДокумента,МассивУзлов,ТаблицаРегистрации = "ТК_НоменклатураДляИзмененияOS")
	
	КоличествоСтрокДокумента = ТоварыДокумента.Количество();
	
	Если КоличествоСтрокДокумента>20 Тогда
		ОбменФронт.ЗапуститьФоновоеЗаданиеРегистацииВыгрузкиОстатков(ТипОбъекта,ДатаРегистрации,СкладКомпании,ТоварыДокумента,МассивУзлов,ТаблицаРегистрации);
	Иначе
		Если ТипОбъекта = Тип("ДокументОбъект.ПересортицаТоваров") Тогда
			ОбменФронт.ЗарегистрироватьОстаткиТаблицаТоваровПересортицы(ДатаРегистрации,СкладКомпании,ТоварыДокумента,МассивУзлов,ТаблицаРегистрации);
		Иначе
			ОбменФронт.ЗарегистрироватьОстаткиТаблицаТоваров(ДатаРегистрации,СкладКомпании,ТоварыДокумента,МассивУзлов,ТаблицаРегистрации);

		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


Функция НеобходимаРегистрацияПоСкладу(СкладКомпании)
	Регистрация = УправлениеСвойствами.ЗначениеСвойства(СкладКомпании,"OS_АктивныеСклады");
	Если Регистрация = Неопределено Или Регистрация = Ложь Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ТекстЗапросаНаИзменение(ТипОбъекта)
	
	Если ТипОбъекта = Тип("ДокументОбъект.ПересортицаТоваров") Тогда
			ТекстЗапросаТовары ="ВЫБРАТЬ
			|	Товары.НоменклатураРасход КАК НоменклатураРасход,
			|	Товары.НоменклатураПриход КАК НоменклатураПриход,
			|	Товары.ХарактеристикаНоменклатурыРасход КАК ХарактеристикаНоменклатурыРасход,
			|	Товары.ХарактеристикаНоменклатурыПриход КАК ХарактеристикаНоменклатурыПриход,
			|	Товары.КоличествоБазовоеРасход КАК КоличествоБазовоеРасход,
			|	Товары.КоличествоБазовоеПриход КАК КоличествоБазовоеПриход
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.НоменклатураПриход КАК Номенклатура,
			|	ВТ.ХарактеристикаНоменклатурыПриход КАК ХарактеристикаНоменклатуры,
			|	ВТ.КоличествоБазовоеПриход КАК КоличествоБазовое
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	ВТ КАК ВТ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТ.НоменклатураРасход,
			|	ВТ.ХарактеристикаНоменклатурыРасход,
			|	ВТ.КоличествоБазовоеРасход
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////" ;
		ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.Инвентаризация") Тогда	
			ТекстЗапросаТовары ="ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВЫБОР
			|		КОГДА Товары.Количество < 0
			|			ТОГДА -Товары.Количество
			|		ИНАЧЕ Товары.Количество
			|	КОНЕЦ КАК КоличествоБазовое
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Номенклатура КАК Номенклатура,
			|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВТ.КоличествоБазовое КАК КоличествоБазовое
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.КоличествоБазовое <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////" ;

		Иначе
			ТекстЗапросаТовары ="ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	Товары.КоличествоБазовое КАК КоличествоБазовое
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////" ;

			
		КонецЕсли;

		ТекстЗапросаТовары = ТекстЗапросаТовары + "
		|   ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВложенныйЗапрос.Количество КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		СУММА(ВложенныйЗапрос.Количество) КАК Количество
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
		|			ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|			ОстаткиТоваровКомпании.Количество КАК Количество
		|		ИЗ
		|			РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
		|		ГДЕ
		|			ОстаткиТоваровКомпании.Регистратор = &Регистратор
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВТ_Товары.Номенклатура,
		|			ВТ_Товары.ХарактеристикаНоменклатуры,
		|			СУММА(-ВТ_Товары.КоличествоБазовое)
		|		ИЗ
		|			ВТ_Товары КАК ВТ_Товары
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_Товары.ХарактеристикаНоменклатуры,
		|			ВТ_Товары.Номенклатура) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		|		ВложенныйЗапрос.Номенклатура) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Количество <> 0";

	  Возврат ТекстЗапросаТовары
	
КонецФункции



Процедура РегистрацияТоваров(Источник, РежимЗаписи,РежимПроведения)Экспорт
	
	
	МассивУзловСреза = ОбменФронтПовтИсп.МассивУзловДляРегистрацииОстатки(Источник.ПодразделениеКомпании);
	МассивУзловТекущих = ОбменФронтПовтИсп.МассивУзловДляРегистрацииТекущихОстатков(Источник.ПодразделениеКомпании);

	Если МассивУзловСреза.Количество()=0 И МассивУзловТекущих.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	
	
	ТипОбъекта = ТипЗнч(Источник);
	
	Если ТипОбъекта = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		
		Если Источник.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			СкладКомпании = Источник.СкладКомпании;
		ИначеЕсли Источник.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
			СкладКомпании = Источник.СкладКомпанииПолучатель;
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		СкладКомпании = Источник.СкладКомпании;
	КонецЕсли;
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров")Тогда
		тТорговаяПлощадкаДокумента = Источник.СкладКомпанииПолучатель.ТорговаяПлощадка;
	Иначе
		тТорговаяПлощадкаДокумента = Источник.ТорговаяПлощадка;
	КонецЕсли;
	
	ТекОстатки = ОбменФронтПовтИсп.ЭтоТекущиеОстаткиТП(тТорговаяПлощадкаДокумента);
	Регистрация = НеобходимаРегистрацияПоСкладу(СкладКомпании);
	Если  Регистрация = Ложь Тогда
		Возврат;
	КонецЕсли;  
	
	ДатаДокумента = Источник.Дата;
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		  ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ТК_ДатыОстатковOS.Дата КАК Дата
	              |ИЗ
	              |	РегистрСведений.ТК_ДатыОстатковOS КАК ТК_ДатыОстатковOS
	              |ГДЕ
	              |	ТК_ДатыОстатковOS.СкладКомпании = &СкладКомпании";
		
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Если (ТипОбъекта = Тип("ДокументОбъект.ЗакрытиеСмены") ИЛИ  ТипОбъекта = Тип("ДокументОбъект.Инвентаризация"))  Тогда
			ДатаСреза =  Источник.Дата;
			
			
			Если МассивУзловСреза.Количество()>0 Тогда
				ОбменФронт.ЗарегистрироватОстаткиСклада(СкладКомпании,МассивУзловСреза);
				РегистрыСведений.ТК_ДатыОстатковOS.ЗаписатьНовуюДату(Источник.Дата,СкладКомпании);
				Возврат;
			КонецЕсли;
			Если ТипОбъекта = Тип("ДокументОбъект.ЗакрытиеСмены") И МассивУзловТекущих.Количество()>0 Тогда
				РегистрыСведений.ТК_ДатыОстатковOS.ЗаписатьНовуюДату(Источник.Дата,СкладКомпании);
				ОбменФронт.ЗарегистрироватОстаткиСклада(СкладКомпании,МассивУзловТекущих);
				Возврат;

			ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.Инвентаризация") И МассивУзловТекущих.Количество()>0 Тогда	
				РегистрыСведений.ТК_ДатыОстатковOS.ЗаписатьНовуюДату(НачалоДня(Источник.Дата),СкладКомпании);
				ОбменФронт.ЗарегистрироватОстаткиСклада(СкладКомпании,МассивУзловТекущих);
			КонецЕсли;
			
				
		Иначе
			ДатаСреза = ТекущаяДата();
		КонецЕсли;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ДатаСреза = ВыборкаДетальныеЗаписи.Дата;
		
		Если (ТипОбъекта = Тип("ДокументОбъект.ЗакрытиеСмены") ИЛИ ТипОбъекта = Тип("ДокументОбъект.Инвентаризация")) И  ДатаДокумента > ДатаСреза  Тогда
			
			//ДатаСреза =  ДатаДокумента;
			
			Если МассивУзловСреза.Количество()>0 Тогда
				Если ТекОстатки Тогда
					Если ТипОбъекта = Тип("ДокументОбъект.ЗакрытиеСмены") И  ДатаДокумента > ДатаСреза Тогда
						РегистрыСведений.ТК_ДатыОстатковOS.ЗаписатьНовуюДату(ДатаДокумента,СкладКомпании);
						ОбменФронт.ЗарегистрироватОстаткиСклада(СкладКомпании,МассивУзловСреза);
						Возврат;
					КонецЕсли;
					
				Иначе
					РегистрыСведений.ТК_ДатыОстатковOS.ЗаписатьНовуюДату(ДатаДокумента,СкладКомпании);
					ОбменФронт.ЗарегистрироватОстаткиСклада(СкладКомпании,МассивУзловСреза);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипОбъекта = Тип("ДокументОбъект.ЗакрытиеСмены") И  ДатаДокумента > ДатаСреза  И МассивУзловТекущих.Количество()>0 Тогда
				РегистрыСведений.ТК_ДатыОстатковOS.ЗаписатьНовуюДату(ДатаДокумента,СкладКомпании);
				ОбменФронт.ЗарегистрироватОстаткиСклада(СкладКомпании,МассивУзловТекущих);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ НЕ Источник.Проведен Тогда
		//Регистрация выгрузки остатков изменений до текущего среза
		тзТоварыДокумента = Источник.Товары.Выгрузить();
		Если ТипОбъекта = Тип("ДокументОбъект.ПересортицаТоваров") Тогда
			тзТоварыДокумента.Свернуть("НоменклатураПриход,НоменклатураРасход,ХарактеристикаНоменклатурыПриход,ХарактеристикаНоменклатурыРасход");
		Иначе
			тзТоварыДокумента.Свернуть("Номенклатура,ХарактеристикаНоменклатуры");
		КонецЕсли;

		Если МассивУзловСреза.Количество() > 0 Тогда
			
			Если ТекОстатки Тогда
				РегистрацияТоваровДокумента(ТипОбъекта,ДатаДокумента,СкладКомпании,тзТоварыДокумента,МассивУзловСреза,"ТК_OS_РегистрацияНаВыгрузкуОстатков");
			ИначеЕсли ДатаДокумента < ДатаСреза  Тогда
				РегистрацияТоваровДокумента(ТипОбъекта,ДатаДокумента,СкладКомпании,тзТоварыДокумента,МассивУзловСреза);
			КонецЕсли;
		КонецЕсли;
		//Регистрация для выгрузки текущих остатков
		Если МассивУзловТекущих.Количество() > 0 Тогда
			РегистрацияТоваровДокумента(ТипОбъекта,ДатаДокумента,СкладКомпании,тзТоварыДокумента,МассивУзловТекущих,"ТК_OS_РегистрацияНаВыгрузкуОстатков");
		КонецЕсли;

	Иначе
		
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") И Источник.ДополнительныеСвойства.ЭтоНовый Тогда
			тзТоварыДокумента = Источник.Товары.Выгрузить();
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапросаНаИзменение(ТипОбъекта);
			Запрос.УстановитьПараметр("Регистратор",Источник.Ссылка);
			Запрос.УстановитьПараметр("Товары",Источник.Товары.Выгрузить());
			
			
			Рез = Запрос.Выполнить();
			Если Рез.Пустой() Тогда
				Возврат;
			КонецЕсли;  
			
			тзТоварыДокумента = Рез.Выгрузить();
		КонецЕсли;
		тзТоварыДокумента.Свернуть("Номенклатура,ХарактеристикаНоменклатуры");
		
		//Регистрация выгрузки остатков изменений до текущего среза
		Если МассивУзловСреза.Количество() > 0 Тогда
			Если ТекОстатки Тогда
				РегистрацияТоваровДокумента(Неопределено,ДатаДокумента,СкладКомпании,тзТоварыДокумента,МассивУзловСреза,"ТК_OS_РегистрацияНаВыгрузкуОстатков");
			ИначеЕсли ДатаДокумента < ДатаСреза Тогда
				РегистрацияТоваровДокумента(Неопределено,ДатаДокумента,СкладКомпании,тзТоварыДокумента,МассивУзловСреза);
			КонецЕсли;
		КонецЕсли;
		
		//Регистрация для выгрузки текущих остатков
		Если МассивУзловТекущих.Количество() > 0 Тогда
			РегистрацияТоваровДокумента(Неопределено,ДатаДокумента,СкладКомпании,тзТоварыДокумента,МассивУзловТекущих,"ТК_OS_РегистрацияНаВыгрузкуОстатков");
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры
